{
    "basic_info": {
      "description_header": "Howdy",
      "description": " I'm Valton Jones and I am software engineer with a breadth of experience that spans 20 years of educating, scholarship, public and private service. During the past year I have decided to change careers in order to find a more flexible, rewarding, software development job that leverages my diverse experience and education. I am formerly an operations specialist in the United States Navy and veteran of 4 theaters of combat and peacekeeping operations across the globe. I studied art and political science at university of Washington, worked in the service industry from entry level serving to corporate training to management, and briefly sold and managed commercial and residential real estate for low income housing. I picked this pivot into software developement because my skills in management and training can be translated into more flexible and dynamic roles working for companies that change the world, for the better. Ideally I would like to utilize my technical skills in JavaScript and CSS for a company that utilizes emergent technologies to uplift peoples lives and solve societal injustices. I hope to see you all in the better tomorrow that we can create, together",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "8-Bit Black Jack",
        "startDate": "2021",
        "description": "Our task is to create a website using the skills we learned through Code Fellows Code 201. We will use html, css, vanilla javascript, and will not use api or array methods, such as map, sort, foreach, etc. or es6/7 type functions. In addition, we need to utilize local storage, which is done through player data.",
        "images": [
          "images/Screen Shot 2021-09-15 at 9.22.21 PM.png",
          "images/Start_Here.jpg"
        ],
        "url": "",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      },
      {
        "title": "Photography",
        "startDate": "2018",
        "description": "Personal project for study subject. I was responsible for testing photography application that optimizes images with popular algorithms used by graphic editors like Pixlr or Adobe Photoshop. I've earned A grade :)",
        "images": [
          "images/portfolio/photography/p1.jpg",
          "images/portfolio/photography/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "3D Object Viewer",
        "startDate": "2015",
        "description": "One of the first apps I was working on my internship. I had to develop front-end implementation for app that shows 3D models of known buildings. This was also my first project in Angular framework. I've learned a lot!",
        "images": [
          "images/portfolio/adventure/p1.jpg",
          "images/portfolio/adventure/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "CentraArchy",
        "title": "Server",
        "years": "10.209 - present",
        "mainTech": [
          "Angular 8/9/10"
        ],
        "technologies": [
          "REST API",
          "RxJS",
          "JavaScript",
          "Bootstrap",
          "MDBootstrap",
          "EF Core",
          ".NET Core",
          "SignalR",
          "Angular Material"
        ]
      },
      {
        "company": "Serros Solutions",
        "title": "Intern",
        "years": "01.2018 - 09.2019",
        "mainTech": [
          "Angular 7/8"
        ],
        "technologies": [
          "RxJS",
          "Django",
          "PHP",
          "JavaScript",
          "DHTMLX Gantt"
        ]
      }
    ]
  }
